
create_clock -period 5.000 -name clock [get_ports clock]

set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports {io_ctrl_AR_bits[*]}]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports {io_ctrl_AR_bits[*]}]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports {io_ctrl_AW_bits[*]}]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports {io_ctrl_AW_bits[*]}]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports {io_ctrl_W_bits_wdata[*]}]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports {io_ctrl_W_bits_wdata[*]}]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports {io_ctrl_W_bits_wstrb[*]}]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports {io_ctrl_W_bits_wstrb[*]}]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports {io_in_data[*]}]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports {io_in_data[*]}]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_AR_valid]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_AR_valid]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_AW_valid]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_AW_valid]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_B_ready]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_B_ready]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_R_ready]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_R_ready]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_W_valid]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_W_valid]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports io_in_valid]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports io_in_valid]
set_input_delay -clock [get_clocks clock] -min 0.100 [get_ports reset]
set_input_delay -clock [get_clocks clock] -max 2.500 [get_ports reset]

set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports {io_ctrl_R_bits_rdata[*]}]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports {io_ctrl_R_bits_rdata[*]}]
set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports {io_out_data[*]}]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports {io_out_data[*]}]
set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_AR_ready]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_AR_ready]
set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_AW_ready]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_AW_ready]
set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_B_valid]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_B_valid]
set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_R_valid]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_R_valid]
set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports io_ctrl_W_ready]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports io_ctrl_W_ready]
set_output_delay -clock [get_clocks clock] -min 0.100 [get_ports io_out_valid]
set_output_delay -clock [get_clocks clock] -max 2.500 [get_ports io_out_valid]
